items = ["эл0", "эл1", "эл2", "эл3", "эл0", "эл4", "эл5", "эл6", "эл0", "эл7", "эл8", "эл9"];

print("предпоследний элемент:", items[-2]);
print("элементы по индексам 0, 2 и 5:", items[0], items[2], items[5]);

items[3] = "измененный_эл"
print("список после изменения элемента в позиции 3:", items);

print("элементы в диапазоне от 2 до 7:", items[2:7]);

items.append("эл10");
print("список после добавления в конец:", items);

items.insert(len(items) // 2, "эл_центр");
print("список после добавления в середину:", items);

count_el0 = items.count("эл0");
print("количество повторений 'эл0':", count_el0);

items_copy = items.copy();
items_copy[0] = "модифицирован";
print("первый элемент оригинала:", items[0]);
print("первый элемент копии:", items_copy[0]);